content/index.org
* Home
:PROPERTIES:
:CUSTOM_ID: home
:END:
Hello!

Welcome to my blog, wiki, second-brain thing! This site will mainly consist of my personal notes taken while trying to
learn new things. This will include things such as:

- Minimal desktop Linux setups and tools
- Emacs
- 3D printing
- Programming, embedded programming
- Linux server setup and tools
- And any other things that peak my interest

I keep a (not so updated) list [[file:todo.html][here]] on things that I want to learn and explore.

* Notes and Posts
:PROPERTIES:
:CUSTOM_ID: notes-and-posts
:END:
This website has two purposes:

- Data dump of notes in the format of a connected knowledge base
- Blog posts

** Notes
:PROPERTIES:
:CUSTOM_ID: notes
:END:
This is my knowledge base of [[file:notes.html][notes]]. Its messy, doesn't make much sense, but its mine.

** TODO Blog
:PROPERTIES:
:CUSTOM_ID: blog
:END:

* Social
- [[https://www.youtube.com/channel/UC9Y2Lk1mgsMb-NVZCrkplxQ.html][Youtube]]
- [[https://www.twitch.tv/alexbstudy][Twitch]]
