docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-19 Sat 18:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#home">1. Home</a></li>
<li><a href="#notes-and-posts">2. Notes and Posts</a>
<ul>
<li><a href="#notes">2.1. Notes</a></li>
<li><a href="#blog">2.2. <span class="todo TODO">TODO</span> Blog</a></li>
</ul>
</li>
<li><a href="#org5d56d4c">3. Social</a></li>
</ul>
</div>
</div>
<div id="outline-container-home" class="outline-2">
<h2 id="home"><span class="section-number-2">1.</span> Home</h2>
<div class="outline-text-2" id="text-home">
<p>
Hello!
</p>

<p>
Welcome to my blog, wiki, second-brain thing! This site will mainly consist of my personal notes taken while trying to
learn new things. This will include things such as:
</p>

<ul class="org-ul">
<li>Minimal desktop Linux setups and tools</li>
<li>Emacs</li>
<li>3D printing</li>
<li>Programming, embedded programming</li>
<li>Linux server setup and tools</li>
<li>And any other things that peak my interest</li>
</ul>

<p>
I keep a (not so updated) list <a href="todo.html">here</a> on things that I want to learn and explore.
</p>
</div>
</div>

<div id="outline-container-notes-and-posts" class="outline-2">
<h2 id="notes-and-posts"><span class="section-number-2">2.</span> Notes and Posts</h2>
<div class="outline-text-2" id="text-notes-and-posts">
<p>
This website has two purposes:
</p>

<ul class="org-ul">
<li>Data dump of notes in the format of a connected knowledge base</li>
<li>Blog posts</li>
</ul>
</div>

<div id="outline-container-notes" class="outline-3">
<h3 id="notes"><span class="section-number-3">2.1.</span> Notes</h3>
<div class="outline-text-3" id="text-notes">
<p>
This is my knowledge base of <a href="notes.html">notes</a>. Its messy, doesn't make much sense, but its mine.
</p>
</div>
</div>

<div id="outline-container-blog" class="outline-3">
<h3 id="blog"><span class="section-number-3">2.2.</span> <span class="todo TODO">TODO</span> Blog</h3>
<div class="outline-text-3" id="text-blog">
</div>
</div>
</div>

<div id="outline-container-org5d56d4c" class="outline-2">
<h2 id="org5d56d4c"><span class="section-number-2">3.</span> Social</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/channel/UC9Y2Lk1mgsMb-NVZCrkplxQ.html">Youtube</a></li>
<li><a href="https://www.twitch.tv/alexbstudy">Twitch</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2022-11-19 Sat 18:47</p>
</div>
</body>
</html>
